"""
โจทย์ :
    สร้างไฟล์ใหม่ใน FOLDER /assignments/week09/
    lab-assignment-1109.py

    เครื่องคํานวณค่าไฟฟ้าแบบขั้นบันได
    เขียนโปรแกรมคํานวณค่าไฟฟ้าจากจํานวนหน่วยไฟฟ้าที่ใช้ในเดือนนั้น 
    โดยใช้ฟังก์ชัน
    calculate_electricity_cost(units)

    ค่าไฟฟ้าขึ้นกับปริมาณการใช้งาน
    จำนวนหน่วยที่ใช้         อัตราต่อหน่วย
    1–50 หน่วยแรก            2.50 บาท
    51–100 หน่วย             3.00 บาท
    101–200 หน่วย            3.50 บาท
    มากกว่า 200 หน่วย         4.00 บาท

    ให้คิดค่าบริการคงที่เพิ่มอีก 25 บาทต่อเดือน
    เงื่อนไข

    โปรแกรมแสดงเมนูวนซ้ำ
    - ผู้ใช้เลือก 1 เพื่อคํานวณค่าไฟ
    - ผู้ใช้เลือก 2 เพื่อออกจากโปรแกรม
    - หากเลือกเมนูอื่น 
    ให้แจ้งว่าเลือกเมนูไม่ถูกต้อง
    - จํานวนหน่วยไฟฟ้าต้องไม่ติดลบ
    - ให้แสดงรายละเอียดค่าไฟแต่ละช่วง และยอดรวมสุทธิ

    ตัวอย่างหน้าจอ
    ====== โปรแกรมคํานวณค่าไฟฟ้า ======
    1. คํานวณค่าไฟ
    2. ออกจากโปรแกรม
    เลือกเมนู: 1
    
    กรอกจํานวนหน่วยไฟฟ้า: 120

    รายละเอียดค่าไฟ:
    1-50 หน่วย: 125.00 บาท
    51-100 หน่วย: 150.00 บาท
    101-120 หน่วย: 70.00 บาท
    ค่าบริการ: 25.00 บาท
    รวมค่าไฟฟ้าทั้งสิ้น: 370.00 บาท
"""
def calculate_electricity_cost(unit):
    if unit < 0:
        print("จำนวนหน่วยไฟฟ้าต้องไม่ติดลบ")
        return

    print("\nรายละเอียดค่าไฟ:")

    if unit > 200:
        c1 = 50 * 2.50
        c2 = 50 * 3.00
        c3 = 100 * 3.50
        c4 = (unit - 200) * 4.00
        total = c1 + c2 + c3 + c4 + 25
        print(f"1-50 หน่วย: {c1:.2f} บาท")
        print(f"51-100 หน่วย: {c2:.2f} บาท")
        print(f"101-200 หน่วย: {c3:.2f} บาท")
        print(f"มากกว่า 200 หน่วย: {c4:.2f} บาท")

    elif unit > 100:
        c1 = 50 * 2.50
        c2 = 50 * 3.00
        c3 = (unit - 100) * 3.50
        total = c1 + c2 + c3 + 25
        print(f"1-50 หน่วย: {c1:.2f} บาท")
        print(f"51-100 หน่วย: {c2:.2f} บาท")
        print(f"101-{int(unit)} หน่วย: {c3:.2f} บาท")

    elif unit > 50:
        c1 = 50 * 2.50
        c2 = (unit - 50) * 3.00
        total = c1 + c2 + 25
        print(f"1-50 หน่วย: {c1:.2f} บาท")
        print(f"51-{int(unit)} หน่วย: {c2:.2f} บาท")

    else:
        c1 = unit * 2.50
        total = c1 + 25
        print(f"1-{int(unit)} หน่วย: {c1:.2f} บาท")

    print("ค่าบริการ: 25.00 บาท")
    print(f"รวมค่าไฟฟ้าทั้งสิ้น: {total:.2f} บาท\n")


while True:
    print("====== โปรแกรมคำนวณค่าไฟฟ้า ======")
    print("1. คำนวณค่าไฟ")
    print("2. ออกจากโปรแกรม")

    choice = input("เลือกเมนู: ")

    if choice == "1":
        unit = float(input("กรอกจำนวนหน่วยไฟฟ้า: "))
        calculate_electricity_cost(unit)
    elif choice == "2":
        break
    else:
        print("เลือกเมนูไม่ถูกต้อง\n")