"""
ขอให้สร้าง function ชื่อ deposit(money)
ที่เป็นโปรแกรมจำลองการฝากเงินเข้าบัญชี โดยกำหนดยอดเงินเริ่มต้นเป็น 1,000 บาท
โปรแกรมต้องรับจำนวนเงินที่ต้องการฝากจากผู้ใช้ 1 ครั้ง แล้วคำนวณยอดเงินคงเหลือใหม่

- ใช้ try-except เพื่อจัดการกรณีผู้ใช้กรอกข้อมูลที่แปลงเป็นตัวเลขไม่ได้ เช่น abc
- หากจำนวนเงินฝากน้อยกว่าหรือเท่ากับ 0 ให้ใช้ raise ValueError 
พร้อมข้อความ จำนวนเงินฝากต้องมากกว่า 0
- หากข้อมูลถูกต้อง ให้ใช้ else แสดงยอดเงินคงเหลือใหม่
- ใช้ finally แสดงข้อความ สิ้นสุดรายการฝากเงิน เสมอ
- ห้ามใช้ except: แบบไม่ระบุชนิดข้อผิดพลาด

เมื่อสร้าง function แล้ว ขอให้ทดลองใช้ function ที่สร้างด้วย

Ex 1. หน้าจอ กรณีปกติ

ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: 500

ฝากเงินสำเร็จ
ยอดเงินคงเหลือ: 1500.00 บาท
สิ้นสุดรายการฝากเงิน


Ex 2. หน้าจอ กรณีมีการกรอกข้อมูลผิดพลาด
ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: -200

เกิดข้อผิดพลาด: จำนวนเงินฝากต้องมากกว่า 0
สิ้นสุดรายการฝากเงิน

"""

def deposit(money):
    balance = 1000  # กำหนดยอดเงินเริ่มต้น 1,000 บาท
    print(f"ยอดเงินเริ่มต้น: {balance} บาท")
    
    try:
        amount = float(input("กรอกจำนวนเงินที่ต้องการฝาก: "))
        
        # อันนี้ตรวจสอบว่าจำนวนเงินฝากมากกว่า 0 ไหม
        if amount <= 0:
            raise ValueError("จำนวนเงินฝากต้องมากกว่า 0") 
        # ถ้าไม่มากกว่า 0 จะเกิดข้อผิดพลาด และข้อความที่กำหนดจะถูกส่งไปที่ except ด้านล่าง

    # อันนี้เป็นตัวดักจับข้อผิดพลาด
    except ValueError as e: 
        if str(e) == "จำนวนเงินฝากต้องมากกว่า 0":
            print(f"\nเกิดข้อผิดพลาด: {e}")
        else:
            print("\nเกิดข้อผิดพลาด: กรุณากรอกตัวเลขที่ถูกต้อง")
    
    # ทำงานเมื่อไม่มีอะไรผิดพลาดขึ้นเลย        
    else:
        balance += amount # balance = balance + amount
        print("\nฝากเงินสำเร็จ")
        print(f"ยอดเงินคงเหลือ: {balance:.2f} บาท")

    # เป็นคำสั่งที่จะต้อง ทำงานทุกครั้ง ไม่ว่าจะทำรายการสำเร็จหรือเกิดข้อผิดพลาดก็ตาม
    finally:
        print("สิ้นสุดรายการฝากเงิน")


# เรียกใช้งานฟังก์ชันตามโจทย์
deposit(1000)


"""
ผลลัพธ์ :

ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: 500

ฝากเงินสำเร็จ
ยอดเงินคงเหลือ: 1500.00 บาท
สิ้นสุดรายการฝากเงิน

--------

ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: -200

เกิดข้อผิดพลาด: จำนวนเงินฝากต้องมากกว่า 0
สิ้นสุดรายการฝากเงิน

"""